  ////////////////////////////////////////////////////////////////////////////////////////
  now=-90; //当前角度
  Start=Gyro.rotation(degrees)-now*Side;//陀螺仪标定初始位置
  //Run_gyro(100,-40,now);
  Load.set(true);
  wait(100);
  mode=1;
  Intake(100);
  Ball(100);
  Shoot(100); //开启吸球
  //Run_gyro(300,60,-95);//
  Run_gyro(300, -95);//
  Load.set(false);//收起填装杆
  //Run_gyro(600,60,-95);
  Run_gyro(600, -95);
  Run_time(50,500);
  Turn_Gyro(0);
  Run_time(-50,300);
  wait(100);
  //Run_gyro(120,60,now);
  Run_gyro(120);
  Turn_Gyro(-90);
  //Run_gyro(600,60,now);
  Run_gyro(600);
  F_D_E(-180,-2,7,-1);//
  ////////////////////////////////////////////////////////////////////////////////////////
  //Run_gyro(150,-60,now);//前进到长桥
  Run_gyro(-150);//前进到长桥
  Turn_Gyro(-45);
  //Run_gyro(250,60,-30);//前进到长桥
  Run_gyro(250, -30);//前进到长桥
  //Run_gyro(1350,80,-10);//前进到长桥
  Run_gyro(1350, -10);//前进到长桥
  Turn_Gyro(-90);
  F_D_E(0,182,4,0); 
  ////////////////////////////////////////////////////////////////////////////////////////
  //Run_gyro(400,-60,now);
  Run_gyro(-400);
  Turn_Gyro(60);
  //Run_gyro(200,60,now);
  Run_gyro(200);
  //Run_gyro(200,60,85);
  Run_gyro(200, 85);
  Load.set(true);
  //Run_gyro(300,60,85);
  Run_gyro(300, 85);
  Load.set(false);
  //Run_gyro(600,60,85);
  Run_gyro(600, 85);
  Run_time(50,500);
  Turn_Gyro(180);
  Run_time(-50,300);
  wait(100);
  //Run_gyro(120,60,now);
  Run_gyro(120);
  Turn_Gyro(90);
  //Run_gyro(500,60,now);
  Run_gyro(500);
  Run_time(60,300);
  F_D_E(0,178,6,1);
  //////////////////////////////////////////////////////////////////////////////////////////
  //Run_gyro(150,-60,now);//前进到长桥
  Run_gyro(-150);//前进到长桥
  Turn_Gyro(135);
  //Run_gyro(250,60,150);//前进到长桥
  Run_gyro(250, 150);//前进到长桥
  //Run_gyro(1350,80,170);//前进到长桥
  Run_gyro(1350, 170);//前进到长桥
  Turn_Gyro(90);
  F_D_E(180,2,4,0); 
  ////////////////////////////////////////////////////////////////////////////////////////
  //Run_gyro(100,-60,now);
  Run_gyro(-100);
  Turn_Gyro(-90);
  //Run_gyro(680,60,now);
  Run_gyro(680);
  Turn_Gyro(-180);
  Run_time(80,1000);
  ////////////////////////////////////////////////////////////////////////////////////////


    // Run_gyro(120,-60,now);
  // Intake(100);
  // Ball(100);
  // Shoot(100); //开启吸球
  // Turn_Gyro(90);//转向面对长桥
  // Run_gyro(2000,80,now);
  // F_D_E(180,0,4);
  // ////////////////////////////////////////////////////////////////////////////////////////
